app/views/quotes/_form.html.erb

    <b> Author
    <%= f.collection_select :philosopher_id, Philosopher.all, :id, :full_name, { include_blank: true }, class: "form-control" %> </b>
---
SELECT "philosophers".* FROM "philosophers"

  <b>Categories:</b>
    <% @quote.quote_categories.each do |quote_category| %>
---
SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]

            <!-- The following lines create the dropdown list for selecting an category -->
            <%= ri.select :category_id, Category.all.distinct.collect { |cat| [cat.category_name, cat.id] }, { include_blank: true }, class: "form-control d-inline-block" %>
---
SELECT DISTINCT "categories".* FROM "categories"