app/views/quotes/_quote.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 8]]
---
                <a href="/quotes/<%=quote.id %>">View Details</a>
                <% categories = quote.categories.map(&:category_name).join(', ') %>