app/views/quotes/_quote.html.erb

SELECT "quotes".* FROM "quotes"
---

            <% quote.quote.each do |quote_d| %>