app/views/quotes/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
---
      <!-- Joins all quotes by ", "; this ensures a nice looking list with no extra commas. -->
        <% categories = @quote.categories.map(&:category_name).join(', ') %>