app/views/home/aindex.html.erb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "quotes"
SELECT COUNT(*) FROM "philosophers"
SELECT COUNT(*) FROM "categories"
---
    <p>
        Registered Users: <%= User.count %> | <%= link_to "Manage Users", users_path %><br>
        Quotes: <%= Quote.count %> | <%= link_to "Manage Quotes", quotes_path %><br>
        Authors: <%= Philosopher.count %> | <%= link_to "Manage Authors", philosophers_path %><br>
        Categories: <%= Category.count %> | <%= link_to "Manage Categories", categories_path %><br>