app/controllers/categories_controller.rb

INSERT INTO "categories" ("category_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["category_name", "Metaphysics"], ["created_at", "2023-10-16 10:25:38.820455"], ["updated_at", "2023-10-16 10:25:38.820455"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save