app/controllers/home_controller.rb

  def index
    # Creating a variable @quote that contains all the details that we will be referencing on the index page referencing quotes, including their categories and the author. Only taking 5 (of the most recently created.)
    @quotes = Quote.joins(:philosopher, :quote_categories, :categories).distinct.take(5)
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
SELECT "philosophers".* FROM "philosophers" INNER JOIN "quotes" ON "quotes"."philosopher_id" = "philosophers"."id" ORDER BY "quotes"."created_at" ASC
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "philosophers" ON "philosophers"."id" = "quotes"."philosopher_id" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "quote_categories" "quote_categories_quotes_join" ON "quote_categories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories_quotes_join"."category_id" LIMIT ?  [["LIMIT", 5]]

  def uquotes
        # Creating a variable @quote that contains all the details that we will be referencing on the your quotes page, only merging quotes that contain the current user's user_id, as only their quotes will be shown.
    @quotes = Quote.joins(:philosopher, :quote_categories, :categories).distinct.merge(Quote.where(user_id: current_user.id))
---
SELECT "philosophers".* FROM "philosophers" INNER JOIN "quotes" ON "quotes"."philosopher_id" = "philosophers"."id" WHERE "philosophers"."user_id" = ?  [["user_id", 4]]
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "philosophers" ON "philosophers"."id" = "quotes"."philosopher_id" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "quote_categories" "quote_categories_quotes_join" ON "quote_categories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories_quotes_join"."category_id" WHERE "quotes"."user_id" = ?  [["user_id", 2]]