app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 2]]
---
  def uquotes
    @quotes = Quote.where(user_id: session[:user_id])