app/controllers/philosophers_controller.rb

SELECT "philosophers".* FROM "philosophers"
---
  def index
    @philosophers = Philosopher.all

INSERT INTO "philosophers" ("fname", "lname", "b_year", "d_year", "biography", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @philosopher = Philosopher.new(philosopher_params)

    respond_to do |format|
      if @philosopher.save

UPDATE "philosophers" SET "biography" = ?, "updated_at" = ? WHERE "philosophers"."id" = ?
---
  def update
    respond_to do |format|
      if @philosopher.update(philosopher_params)

DELETE FROM "philosophers" WHERE "philosophers"."id" = ?  [["id", 5]]
---
  def destroy
    @philosopher.destroy

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_philosopher
      @philosopher = Philosopher.find(params[:id])