app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("pubyear", "quotetext", "comment", "is_public", "user_id", "philosopher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "user_id" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["user_id", 1], ["updated_at", "2023-10-18 07:29:55.287520"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)