app/controllers/search_controller.rb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
SELECT "philosophers".* FROM "philosophers" INNER JOIN "quotes" ON "quotes"."philosopher_id" = "philosophers"."id" WHERE (quote.quotetext LIKE '%the%')
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "philosophers" ON "philosophers"."id" = "quotes"."philosopher_id" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "quote_categories" "quote_categories_quotes_join" ON "quote_categories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories_quotes_join"."category_id" WHERE (philosophers.fname LIKE '%philosopher%' OR philosophers.lname LIKE '%%')
---
  def index
    # Search_query is set by the search_query in the sessions/index view.
    search_query = params[:search_query]
    # Search_query is set by the search_option in the sessions/index view.
    search_option = params[:search_option]

    # When search_query is entered.
    if search_query.present?
      if search_option == "category"
        #If the search_option is category, search the search_query inside all quotes categories.
        #Set the @quotes variable to all the quotes that were found with that criteria. These will be displayed.
        @quotes = Quote.joins(:philosopher, :quote_categories, :categories).distinct.where("categories.category_name LIKE ?", "%#{search_query}%")