app/controllers/sessions_controller.rb

    def create
        # First finds a user by the email entered in the /login view.
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "setonwebber@gmail.com"], ["LIMIT", 1]]