app/controllers/users_controller.rb

  def index
    # if there is a logged in user and that user is the administrator
    if logged_in? && is_administrator?
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    puts "Create run."
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    puts "Update run."
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "lname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lname", "Webber"], ["updated_at", "2023-10-18 07:19:54.162642"], ["id", 6]]